run/flowthermal/FTL-Lesson2/constant/flowthermolabProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      flowthermolabProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

username flowthermolab;

offsetValue 2.0;

incompressibleFlag yes;

inputValues
(
    0
    1
    2
);

inputHashTable
(
    input1 (10 0 0)
    input2 (0 0.5 10)
);

// ************************************************************************* //
