run/flowthermal/FTL-Lesson2/constant/jyothisProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      jyothisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

username jyothis;

offsetValue 10.0;

incompressibleFlag no;

inputValues
(
    10
    11
    12
);

inputHashTable
(
    input1 (10 0 0)
    input2 (0 0.5 10)
    input3 (10 10 10)
    input4 (15 15 15)
);

// ************************************************************************* //
